import { IdolType, YearDescType } from '@/types/idols.d';

import { Y1996 } from './1996';
import { Y1997 } from './1997';
import { Y1998 } from './1998';
import { Y1999 } from './1999';
import { Y2000 } from './2000';
import { Y2001 } from './2001';
import { Y2002 } from './2002';
import { Y2003 } from './2003';
import { Y2004 } from './2004';
import { Y2005 } from './2005';
import { Y2006 } from './2006';
import { Y2007 } from './2007';
import { Y2008 } from './2008';
import { Y2009 } from './2009';
import { Y2010 } from './2010';
import { Y2011 } from './2011';
import { Y2012 } from './2012';
import { Y2013 } from './2013';
import { Y2014 } from './2014';
import { Y2015 } from './2015';
import { Y2016 } from './2016';
import { Y2017 } from './2017';
import { Y2018 } from './2018';
import { Y2019 } from './2019';

export const IDOLS: IdolType[] = [
  ...Y1996,
  ...Y1997,
  ...Y1998,
  ...Y1999,
  ...Y2000,
  ...Y2001,
  ...Y2002,
  ...Y2003,
  ...Y2004,
  ...Y2005,
  ...Y2006,
  ...Y2007,
  ...Y2008,
  ...Y2009,
  ...Y2010,
  ...Y2011,
  ...Y2012,
  ...Y2013,
  ...Y2014,
  ...Y2015,
  ...Y2016,
  ...Y2017,
  ...Y2018,
  ...Y2019,
];

export const YEAR_INFO = {
  start: 1996,
  end: 2019,
};

export const YEARS: YearDescType[] = [
  {
    year: 1996,
    desc: '서태지와 아이들 은퇴, OECD 회원국이 됨, 코스닥 개장, 애틀란타 올림픽, 운동권의 쇠퇴, 전/노 대통령 사형선고, 유니텔 서비스 시작, FM 방송 시작, 시트콤 남자셋 여자셋 방영, 국민학교가 초등학교가 됨, 서지원 자살, 김광석 의문사, 디아블로 출시',
  },
  {
    year: 1997,
    desc: '1세대 아이돌의 홍수, IMF 외환위기, 노동법 날치기, 세일러문 붐, 청소년 보호법 제정, 다이애나비 사망, 화성착륙, 홍콩의 중국 반환, 황장엽 망명, 파이날판타지 7 출시, 원피스 연재, 슈퍼 301조 발동, 영혼기병 라젠카, DJP 야합',
  },
  {
    year: 1998,
    desc: '외환위기/실업난 본격화, 김대중 대통령 취임, 타이타닉 개봉, CGV 개점, 벤처기업 열풍, 음악의 해, 1세대 아이돌의 전성기, 가요톱텐 종영, 뮤직뱅크 방영 시작, 엘리뇨/라니냐 심, 스타크래프트 출시, 윈도우 98출시, 빌 클린턴 대통령 스캔들, 금강산 관광 시작',
  },
  {
    year: 1999,
    desc: 'Y2K 공포, 유로화 출범, 씨랜드 청소년수련원 화재, 대전 법조비리, 쉬리 개봉, ADSL 서비스 시작, 스타워즈 에피소드1 상영, 다음 카페 서비스 개시, 제 1 연평해전, 신창원 검거, 펌프 게임 출시, 휴대전화 가입자 2000만 돌파, 개그콘서트 방송 시작, 롯데시네마/메가박스 개점, 마카오 중국 반환',
  },
  {
    year: 2000,
    desc: 'IT 버블 꺼짐, 초고속 인터넷 정착, 무료 홈페이지 유행, 소리바다 전성기, 남북 정상회담, 대규모 이산가족 상봉, 공동경비구역 JSA 개봉, 푸틴 취임, 디아블로2 발매, 온게임넷 개국, 콩코드 추락, 의약분업, 쿠르스크함 침몰, 홍석천 커밍아웃, 가을동화 방영, 시드니 올림픽, 부시 대통령 당선',
  },
];
